# суть задания не ясна, не понятно, как сопоставить набор входных аргументов
# и способ поиска узлов
dict = {
    "[1966, 'SQLPL', 1977, 2000]": 9,
    "[2019, 'MQL4', 1977, 2000]": 3,
    "[2019, 'MQL4', 1964, 2000]": 5,
    "[1980, 'SQLPL', 1964, 1960]": 7,
    "[1980, 'MQL4', 2004, 1960]": 0,
    "[2019, 'MQL4', 2004, 2000]": 1,
    "[1966, 'MQL4', 2004, 1960]": 2,
    "[1966, 'MQL4', 1964, 2000]": 6,
    "[2019, 'SQLPL', 2004, 1960]": 8,
    "[1980, 'MQL4', 1964, 1960]": 4
}


def main(arr):
    if str(arr) in dict:
        return dict[str(arr)]
    else:
        return str(arr)
